Repository: 84000/data-translation-memory
Catalog: toh558-v1.tmx
Source language: bo
Languages: en

source: སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ། །
en: I pay homage to all buddhas and bodhisattvas!

source: འདི་སྐད་བདག་གིས་ཐོས་པའི་དུས་གཅིག་ན།
en: Thus have I heard at one time.

source: བཞུགས་སོ།
en: was dwelling

source: རྒྱལ་པོའི་ཁབ་ན། བྱ་རྒོད་ཕུང་པོའི་རིའི་ལྷོ་ཕྱོགས་ཀྱི་ངོས་སངས་རྒྱས་ཀྱི་སྤྱོད་ཡུལ་ཤིང་ལྗོན་པ་རབ་ཏུ་སྣང་བའི་ནགས་ཚོགས་ན་
en: in Rājagṛha, on the southern slope of Vulture Peak Mountain in the luminous grove of jewel trees, the domain of the Buddha,

source: དགེ་སློང་སྟོང་ཉིས་བརྒྱ་ལྔ་བཅུའི་དགེ་སློང་གི་དགེ་འདུན་ཆེན་པོ་དག་དང་ཐབས་ཅིག་ཏུ་
en: together with a large monastic assembly of 1,250 monks.

source: དགེ་སློང་གི་དགེ་འདུན་ཆེན་པོ་སྟོང་ཉིས་བརྒྱ་ལྔ་བཅུ་ལ་འདི་ལྟ་སྟེ། ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་དང་། ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུ་ཆེན་པོ་དང་། ཚེ་དང་ལྡན་པ་འོད་སྲུང་ཆེན་པོ་དང་། ཚེ་དང་ལྡན་པ་ག་ཡཱ་འོད་སྲུང་དང་། ཚེ་དང་ལྡན་པ་ཆུ་ཀླུང་འོད་སྲུང་དང་། ཚེ་དང་ལྡན་པ་ཅང་ཤེས་ཀཽཎྜི་ནྱ་དང་། ཚེ་དང་ལྡན་པ་དགའ་བྱེད་དང་། ཚེ་དང་ལྡན་པ་ཀཱ་ཏྱཱའི་བུ་ཆེན་པོ་དང་། ཚེ་དང་ལྡན་པ་བཀྐུ་ལ་དང་། ཚེ་དང་ལྡན་པ་རླངས་པ་དང་། ཚེ་དང་ལྡན་པ་གསུས་པོ་ཆེ་དང་། ཚེ་དང་ལྡན་པ་ངག་དབང་དང་། ཚེ་དང་ལྡན་པ་རྟ་ཐུལ་དང་། ཚེ་དང་ལྡན་པ་རབ་འབྱོར་དང་། ཚེ་དང་ལྡན་པ་ལག་བཟང་དང་། ཚེ་དང་ལྡན་པ་མ་འགགས་པ་དང་། ཚེ་དང་ལྡན་པ་ལྟེང་རྒྱས་འོད་སྲུང་དང་། ཚེ་དང་ལྡན་པ་ནམ་གྲུ་ནས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོའི་བར་དུ་དེ་ལ་སོགས་པའི་
en: This assembly included venerable Śāriputra, venerable Mahā­maudgalyāyana, venerable Mahākāśyapa, venerable Gayākāśyapa, venerable Nadīkāśyapa, venerable Ājñāta­kauṇḍinya, venerable Nandika, venerable Mahākātyāyana, venerable Bakkula, venerable Vāṣpa, venerable Koṣṭhila, venerable Vāgīśa, venerable Aśvajit, venerable Subhūti, venerable Suvāhu, venerable Aniruddha, venerable Uruvilvā­kāśyapa, venerable Revata, and venerable Ānanda, among others.

source: དེའི་ཚེ་བཅོམ་ལྡན་འདས་དགེ་སློང་གི་དགེ་འདུན་དང་བཅས་པ་ལ་ལུས་འཕགས་མོའི་བུ་ཡུལ་མ་ག་དྷཱའི་རྒྱལ་པོ་མ་སྐྱེས་དགྲས་ན་བཟའ་དང་། བཤོས་དང་། གཟིམས་ཆ་དང་། སྙུན་གྱི་གསོས་སྨན་དང་། ཡོ་བྱད་རྣམས་ཀྱིས་བཀུར་སྟིར་བྱས། བླ་མར་བྱས། བསྟི་སྟང་དུ་བྱས། མཆོད་པར་བྱས་སོ། །
en: At that time, the Blessed One and his monastic assembly were venerated, revered, honored, and worshipped by Ajātaśatru, king of Magadha, son of Vaidehī, who offered them clothes, food, bedding, medicine, and other material necessities.

source: ཡང་དེའི་ཚེ་ས་ཡང་ཆེར་གཡོས་པར་གྱུར།
en: Just then, the earth shook tremendously,

source: སྤྲིན་འདུས་པ་ཆེན་པོ་ཡང་བྱུང་།
en: a massive cloud formation appeared,

source: དུས་མ་ཡིན་པའི་རླུང་དང་། སེར་བ་ཆེན་པོ་དང་། སྤྲིན་ཆེན་པོ་ལས་ཆར་པ་ཆེན་པོ་ཡང་འབབ་པར་གྱུར།
en: there was an untimely wind, strong hail began to fall, and a heavy rain fell from the massive cloud.

source: འབྲུག་ཀྱང་དི་རི་རི་ཟེར། གློག་ཀྱང་བྱུང་།
en: Thunder roared and lightning flashed.

source: ཕྱོགས་བཅུ་ཡང་འཁྲུགས་པར་གྱུར་ཏོ། །
en: Chaos erupted throughout the ten directions.

source: མུན་པ་མུན་ནག་ཆེན་པོ་ཡང་བྱུང་སྟེ། སྐར་མ་རྣམས་ཀྱང་མི་སྣང་། ཉི་མ་དང་ཟླ་བ་རྣམས་ཀྱང་འོད་དང་མི་ལྡན་པར་གྱུར་ཏེ།
en: A thick darkness then settled, such that the stars disappeared and even the sun and moon were dimmed.

source: ལྷན་ནེར་མ་ཡིན། ལྷང་ངེར་མ་ཡིན་ཞིང་འོད་མི་གསལ་བར་གྱུར་ཏོ།
en: No longer gleaming and luminous, they ceased to shine.

source: བཅོམ་ལྡན་འདས་ཀྱིས་མི་ལས་འཕགས་པའི་སྤྱན་རྣམ་པར་དག་པས་གཟིགས་སོ
en: With his pristine, divine vision, superior to that of humans, the Blessed One saw

source: ཡངས་པ་ཅན་གྱི་གྲོང་ཁྱེར་ཆེན་པོར་འཇིགས་པ་དེ་དག་བྱུང་བ་
en: those frightening things occur in the city of Vaiśālī.

source: ཡངས་པ་ཅན་གྱི་ལི་ཙྪ་བཱི་ཁ་ཅིག་གིས་གྲོང་གཞན་དང་གྲོང་ཁྱེར་བ་གང་ཡིན་པ་དེ་གདོན་འབྱུང་པོས་བཏབ་པར་གྱུར།
en: villages belonging to certain Licchavi people of Vaiśālī were afflicted with elemental spirits.

source: གྲོང་གི་གཞོན་ནུ་རྣམས་དང་། རྩིས་མཁན་རྣམས་དང་། བློན་པོ་དང་། བློན་པོ་ཆེན་པོ་དང་། འཁོར་ན་གནས་པ་དང་། བྲན་ཕོ་དང་། བྲན་མོ་དང་། ལས་བྱེད་པ་དང་། མངག་པ་དང་། གཡོག་ཁ་ཅིག་ཀྱང་གདོན་འབྱུང་པོས་བཏབ་པར་གྱུར།
en: some of the village youth, astrologers, councilors, prime ministers, court members, servant men and women, laborers, messengers, and attendants were also afflicted with elemental spirits.

source: ཡུལ་ཡངས་པ་ཅན་གྱི་ལྗོངས་ཀུན་གྱི་དགེ་སློང་དང་། དགེ་སློང་མ་དང་། དགེ་བསྙེན་དང་། དགེ་བསྙེན་མ་རྣམས་ཀྱང་འཇིགས་སྐྲག་དངངས་ཏེ་སྐྱི་བུང་ཞེས་བྱེད་ནས་ཁ་གནམ་དུ་བལྟས་ཏེ་ངུ་འབོད་
en: the monks and nuns and the men and women with lay vows throughout the entire land of Vaiśālī were all frightened, looking up to the sky, and crying out in horror.

source: སངས་རྒྱས་དང་། ཆོས་དང་། དགེ་འདུན་ལ་ཕྱག་འཚལ།
en: They paid homage to the Buddha, the Dharma, and the Saṅgha.

source: བྲམ་ཟེ་དང་ཁྱིམ་བདག་གང་དག་སངས་རྒྱས་ཀྱི་བསྟན་པ་ལ་མངོན་པར་མ་དད་པའི་བྲམ་ཟེ་དང་། ཁྱིམ་བདག་
en: the brahmins and householders without particular devotion toward the Buddha’s teachings,

source: ཁ་ཅིག་ནི་ཚངས་པ་ལ་ཕྱག་འཚལ། ཁ་ཅིག་ནི་བརྒྱ་བྱིན་ལ། ཁ་ཅིག་ནི་འཇིག་རྟེན་སྐྱོང་བ་རྣམས་ལ་ཕྱག་འཚལ། །
en: some paid homage to Brahmā; some paid homage to Śakra; some paid homage to the guardians of the world;

source: དབང་ཕྱུག་ཆེན་པོ་དང་། ནོར་བུ་བཟང་པོ་དང་། གང་བ་བཟང་པོ་དང་། འཕྲོག་མ་དང་། ཉི་མ་དང་། ཟླ་བ་དང་། གཟའ་དང་། སྐར་མ་དང་།
en: Maheśvara, Māṇibhadra, Pūrṇabhadra, Hārītī, the sun, the moon, the planets, the stars,

source: རི་དང་། ནགས་ཚོགས་དང་། སྨན་དང་། ཤིང་ལྗོན་པ་དང་། ཀླུང་དང་། ལྟེང་ཀ་དང་། མཚེའུ་དང་། རྫིང་བུ་དང་། རྫིང་དང་། མཆོད་རྟེན་གྱི་གནས་ན་གནས་པ་དག་
en: those spirits that dwell in mountains, forests, thickets, trees, rivers, fountains, ponds, pools, wells, and reliquaries.

source: བདག་ཅག་འདི་འདྲ་བའི་གནོད་པས་འཇིགས་པའི་གནས་ནས་ཇི་ལྟར་ཐར་བར་འགྱུར་སྙམ་དུ་སེམས་ཤིང་འཁོད་པ་དག་
en: everyone was sitting and wondering, “How can we be freed from the peril of such a calamity?”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་རྫུ་འཕྲུལ་མངོན་པར་འདུ་མཛད་པ་གང་མངོན་པར་འདུ་མཛད་པས་
en: The Blessed One then manifested a miraculous feat by which

source: སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་དབྱངས་ཀྱིས་གོ་བར་གྱུར་ནས་
en: a sound was heard throughout all realms of the trichiliocosm,

source: ལྷ་དང་མི་དང་ལྷ་མ་ཡིན་དུ་བཅས་པའི་འཇིག་རྟེན་དད་པར་གྱུར་ཏེ་འདུས་པར་གྱུར་པ་
en: causing the world of gods, humans, and demigods to have faith and assemble.

source: དེ་ནས་མི་མཇེད་ཀྱི་བདག་པོ་ཚངས་པ་དང་། ཚངས་རིས་ཀྱི་ལྷ་རྣམས་དང་། ལྷ་རྣམས་ཀྱི་དབང་པོ་བརྒྱ་བྱིན་དང་། སུམ་ཅུ་རྩ་གསུམ་གྱི་ལྷ་རྣམས་དང་། རྒྱལ་པོ་ཆེན་པོ་བཞི་དང་། རྒྱལ་ཆེན་བཞིའི་རིས་ཀྱི་ལྷ་རྣམས་དང་། གནོད་སྦྱིན་གྱི་སྡེ་དཔོན་ཉི་ཤུ་རྩ་བརྒྱད་དང་། གནོད་སྦྱིན་ཆེན་པོ་སྟོབས་པོ་ཆེ་སུམ་ཅུ་རྩ་གཉིས་དང་། འཕྲོག་མ་བུ་དང་བཅས་འཁོར་དང་བཅས་པ་ཁ་དོག་འཕགས་པ་དག་
en: At that point, Brahmā, master of the world; the gods of the Brahma realm; Śakra, lord of the gods; the gods of the realm of the Thirty-Three; the four great kings and the gods of their realm; the twenty-eight yakṣa generals; the thirty-two great yakṣa warriors; and Hārītī with her sons, together with their retinues, all with sublime complexions,

source: བྱ་རྒོད་ཕུང་པོའི་རི་ལ་བདག་གི་ཁ་དོག་དང་མཐུས་སྣང་བ་ཆེན་པོས་སྣང་བར་བྱས་ཏེ།
en: used their respective complexions and powers to bathe Vulture Peak Mountain in bright light,

source: ནུབ་མོ་འདས་པ་དང་། དག་པ་ལྟ་བུའི་
en: like a pristine dawn once the night has passed.

source: བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་དོང་ནས་ཕྱིན་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ་ཕྱོགས་གཅིག་ཏུ་འཁོད་ནས་
en: Approaching the Blessed One, they bowed their heads to his feet, sat to one side, then

source: ཚིག་གཅིག་དབྱངས་གཅིག་ངག་གཅིག་ཏུ་བཅོམ་ལྡན་འདས་ལ་ཚིགས་སུ་བཅད་དེ་མངོན་པར་བསྟོད་པ།
en: praised the Blessed One in verses of unified phrasing, cadence, and meter:

source: ཤིན་ཏུ་འབར་བའི་གསེར་དང་འདྲ། །ཟླ་བ་ཉ་བའི་འོད་དང་མཚུངས།
en: “You shine with the luster of burnished gold, Like the light of the full moon.

source: དཔལ་ལྡན་རྣམ་ཐོས་བུ་བཞིན་བརྟན། །རིན་ཆེན་རྣམས་ཀྱི་འབྱུང་གནས་ལགས། །
en: As stable as Vaiśravaṇa, You are the source of all jewels.

source: སེང་གེ་གླང་ཆེན་འདྲ་བའི་འགྲོས། །གླང་ཆེན་མྱོས་པ་བཞིན་དུ་གནོན། །
en: Lion-Like One, with your elephant-like gait, You advance like an elephant in rut.

source: གསེར་གྱི་རི་བོ་དང་ཡང་མཚུངས། །འཛམ་བུ་གླིང་གི་གསེར་རྒྱན་འདྲ། །
en: You are like a golden mountain, Or an ornament made of gold from the Jambu River.

source: སྐར་མ་རྣམས་ཀྱིས་ཡོངས་བསྐོར་བའི། །ནམ་མཁའི་ཟླ་བ་དྲི་མེད་བཞིན། །ཉན་ཐོས་དགེ་འདུན་རྣམས་ཀྱི་དབུས། །མཚན་རྣམས་ཀྱིས་ནི་བརྒྱན་པར་གྱུར། །
en: Like the moon in a cloudless sky Studded with stars, You are adorned with sublime characteristics In the midst of a śrāvaka assembly.

source: ལྷ་དང་བཅས་པའི་འཇིག་རྟེན་འདི། །ཐུབ་པ་ལ་ནི་སྐྱབས་སུ་མཆི། །
en: This world with its gods Comes to the Sage for refuge.

source: མི་རྣམས་ལ་ནི་ཕན་པའི་ཕྱིར། །སྲུང་བ་དུས་སུ་ཉེ་བར་གནས།
en: The time for safeguarding The welfare of humans has neared!

source: སངས་རྒྱས་སྔ་མས་བཤད་པ་ཡི། །སྟོང་ཆེན་རབ་འཇོམས་མདོ་སྡེ་འདི། །
en: This sūtra, Destroyer of the Great Trichiliocosm , Disclosed by the previous buddhas,

source: ཁོ་ར་ཁོར་ཡུག་རི་མཐའི་བར། །མཚམས་གཅོད་པ་ཡི་དམ་པ་ལགས། །
en: Is the supreme boundary that seals the area, All the way to the ends of the surrounding mountains.

source: ཕྱག་འཚལ་སྐྱེས་བུ་དཔའ་ཁྱོད་ལ། །
en: We pay homage to you, heroic being!

source: ཕྱག་འཚལ་སྐྱེས་བུ་མཆོག་ཁྱོད་ལ། །
en: We pay homage to you, supreme being!

source: ཆོས་ཀྱི་རྒྱལ་པོ་ཐུབ་ཆེན་ལ། །ཐལ་མོ་སྦྱར་ཏེ་ཕྱག་འཚལ་ལོ། །
en: To the great Sage, king of Dharma, We pay homage with palms joined!”

source: བཅོམ་ལྡན་འདས་ཀྱིས་ཡུད་ཙམ་ཞིག་ཅང་མི་གསུང་བར་དགོངས་ནས་
en: The Blessed One remained silent for a moment, then

source: རྒྱལ་པོ་ཆེན་པོ་བཞི་པོ་དག་ལ་བཀའ་སྩལ་པ།
en: said to the four great kings,

source: རྒྱལ་པོ་ཆེན་པོ་དག་གང་ཁྱོད་ཀྱི་འཁོར་ངའི་འཁོར་ལ་འཚེ་བར་སེམས་པ་དེ་ནི་ཚུལ་མ་ཡིན་ནོ།
en: “Great Kings! It would be improper to think that your assembly could harm my assembly.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། མིའི་འཇིག་རྟེན་འདིར་སངས་རྒྱས་བྱུང་བ་དང་། ཆོས་ལེགས་པར་གསུངས་པ་དང་། དགེ་འདུན་ལེགས་པར་བསྒྲུབས་པ་
en: That is because it is in this world of humans that the Buddha has appeared, the sublime Dharma has been eloquently taught, and the Saṅgha has excellently practiced it.

source: དེ་ལ་ས་བོན་འདི་བཏབ་ན་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་དང་། རང་སངས་རྒྱས་རྣམས་དང་། དགྲ་བཅོམ་པ་རྣམས་དང་། ཉན་ཐོས་རྣམས་འཇིག་རྟེན་དུ་འབྱུང་བར་འགྱུར།
en: The seed planted from this has yielded buddhas, pratyekabuddhas, arhats, and śrāvakas in the world.

source: དེ་ལ་འཇིག་རྟེན་དེ་དག་གིས་དགེ་བའི་རྩ་བ་བསྐྱེད་ནས་ལྷའི་རིས་སུམ་ཅུ་རྩ་གཉིས་ལས་ལྷའི་རིས་གང་ཡང་རུང་བ་དག་ཏུ་སྐྱེ་བར་འགྱུར།
en: Based on generating the roots of virtue with respect to them, beings of the world are born into any of the thirty-two divine realms.

source: རྒྱལ་པོ་དག་ཀྱང་དམག་རྣམ་བཞི་དང་ལྡན་པ་ནས་གླིང་བཞི་ལ་དབང་བའི་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོར་འགྱུར་རོ།
en: And kings, moreover, with their four-division army, become cakra-ruling kings with dominion over the four continents.

source: རྒྱ་མཚོ་ལ་ཐུག་པའི་སའི་དཀྱིལ་འཁོར་ཆེན་པོར་ཆོས་ཀྱི་རྒྱལ་སྲིད་བྱེད་པར་འགྱུར་ཏེ།
en: They exercise righteous rule over the entire earth all the way to the oceans.

source: དེ་དག་ལ་ཡང་བུ་དཔའ་བ། རྟུལ་ཕོད་པ། ཡན་ལག་མཆོག་གི་གཟུགས་དང་ལྡན་པ། ཚན་པོ་ཆེའི་སྟོབས་ཀྱི་ཤུགས་བདོག་པ། ཕ་རོལ་གྱི་སྡེ་རབ་ཏུ་འཇོམས་པ། རིན་པོ་ཆེ་སྣ་བདུན་དང་ལྡན་པ་སྟོང་འབྱུང་བར་འགྱུར་རོ། །
en: They also come to possess a thousand sons, valiant, courageous, handsome in all respects, with the impetuousness of the power of great champions, who vanquish opposing groups and take possession of the seven kinds of precious substances.

source: དེ་བས་ན་འཇིག་རྟེན་འདིར་རྣམ་པ་འདི་ལྟ་བུ་འབྱུང་བར་འགྱུར་བར་ཁྱེད་སྙིང་ལས་ཆུང་ངུས་གནས་པས་གནས་པར་གྱིས་ཤིག །
en: Thus, you should worry little about such a thing happening in this world.”

source: དེ་ནས་རྒྱལ་པོ་ཆེན་པོ་རྣམ་ཐོས་ཀྱི་བུ་སྟན་ལས་ལངས་ཏེ། བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས་པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ཏེ།
en: Then, the great king Vaiśravaṇa arose from his seat, draped his upper robe on one shoulder, and knelt on his right knee.

source: བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་དེ། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: Bowing to the Blessed One with palms joined, he said to him,

source: བཅོམ་ལྡན་འདས་བདག་ཅག་ལ་གྲོང་དང་། སྐྱེད་མོས་ཚལ་དང་། གཞལ་མེད་ཁང་དང་། ཁང་པ་བརྩེགས་པ་དང་། བསིལ་ཁང་དང་། སྒོ་ཁང་དང་། རྟ་བབས་དང་། སྐར་ཁུང་དང་། དར་གྱི་ལྡ་ལྡི་བཟང་ཞིང་མཛེས་པ་རྣམ་པ་སྣ་ཚོགས་དང་ལྡན་པ་དང་། དྲིལ་བུ་དང་མུ་ཏིག་གི་དྲ་བས་ཡོངས་སུ་བསྐོར་བ་དང་། པོག་ཕོར་ནས་བདུག་པས་བདུགས་པ་དག་དང་མེ་ཏོག་གིས་གཏོར་བའི་ཁྱིམ་དང་། གནས་དང་ཁང་པ་ཆེན་པོ་དག་མཆིས་ཏེ།
en: “Blessed One, we have houses, abodes, and estates, including villages, gardens, mansions, apartments, and residences scented with incense censers and strewn with flowers, with porticos, archways, and small windows. Everywhere is festooned with beautiful and bright multi-colored silk streamers and studded with bell and pearl lattice.

source: དེར་བདག་ཅག་བུད་མེད་བརྒྱ་ཕྲག་སྟོང་དག་གིས་ཡོངས་སུ་བསྐོར་ཅིང་འདོད་པའི་ཡོན་ཏན་ལྔ་ཚངས་པར་སྤྱོད་པ་དང་ལྡན་པར་གྱུར་ནས་གནས་ཏེ། །
en: There we dwell, surrounded by hundreds of thousands of girls, fully embroiled in the five sense pleasures.

source: བཙུན་པ་བཅོམ་ལྡན་འདས་བདག་ཅག་རབ་ཏུ་མྱོས་པས་བག་མ་མཆིས་པར་གནས་པས་གནས་པ་ན།
en: Venerable Blessed One, since we are intoxicated and thus remain without a care,

source: འཁོར་ཟས་དང་སྐོམ་ཚོལ་དུ་ཕྱོགས་བཅུ་ཀུན་ཏུ་འབྱེར་
en: our entourages venture out everywhere throughout the ten directions in search of food and drink.

source: བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས་པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ཏེ།
en: draped his upper robe on one shoulder, and knelt on his right knee.

source: བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་ནས། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: Bowing to the Blessed One with palms joined, he said to him,

source: སྐྱེས་པ་དང་། བུད་མེད་དང་། ཁྱེའུ་དང་། བུ་མོ་དང་། བཙས་མ་ཐག་པ་དང་། དུད་འགྲོའི་སྐྱེ་གནས་སུ་གཏོགས་པའི་སྲོག་ཆགས་རྣམས་ཀྱི་མདངས་འཕྲོག །འཚེ་བར་བགྱིད། བགེགས་བགྱིད། གསོད་པར་བགྱིད། སྲོག་དང་བྲལ་བར་བགྱིད་དེ།
en: They thus steal life force, harm, obstruct, murder, and take the lives of men, women, boys, girls, newborns, and animals.

source: བཙུན་པ་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་བདག་ཅག་གིས་འཁོར་བཞིའི་མདུན་དུ་བདག་ཅག་གི་འཁོར་གྱི་ཚུལ་གྱི་མཚན་མ་བསྟན་པར་བགྱིའོ།
en: “We will reveal the physical characteristics of our own respective entourages before the fourfold retinue, in the presence of the Venerable Blessed One.

source: གང་གིས་འཁོར་གྱི་གདོན་བྱུང་བ་དེར་རྒྱལ་པོ་ཆེན་པོ་དེའི་གཟུགས་མཆོད་རྟེན་དང་བཅས་པ་ཆེན་པོ་བགྱིས་ཏེ།
en: There should be formed a magnificent image, along with a shrine, of the great king to whom a particular graha belongs.

source: ནད་པས་རྒྱལ་པོ་ཆེན་པོ་དེའི་མིང་ནས་དབྱུང་ཞིང་དྲི་སྣ་ཚོགས་ཀྱིས་རང་གི་ལག་ནས་བདུག་པར་བགྱིའོ། །
en: The patient should proclaim the name of that great king and scent with his own hand the image and the shrine with various fragrances.

source: དོག་ས་ལ་མེ་ཏོག་སིལ་མ་བཀྲམ་སྟེ། ཞུགས་མར་བུས་ལ་མཆོད་རྟེན་དེ་ལ་མཆོད་པར་བགྱིའོ། །
en: Having strewn the earth with flower petals and offered burning butter-lamps, the patient should then perform worship at that shrine.

source: བཙུན་པ་བཅོམ་ལྡན་འདས་བདག་གི་འཁོར་གནོད་སྦྱིན་གྱི་གདོན་གྱིས་བཏབ་པའི་ཚུལ་གྱི་མཚན་མ་ནི་འདི་ལྟ་བུ་ལགས་ཏེ།
en: “The symptoms of being afflicted by a yakṣa graha belonging to my entourage, Venerable Blessed One, are as follows:

source: ཕྱི་ཕྱིར་རྒོད་ཅིང་འཇིགས་པར་འགྱུར། །སྨྲ་བར་བགྱིད་ཅིང་ཁྲོ་བར་འགྱུར། །
en: “One laughs repeatedly and trembles, Speaks incoherently, and is prone to anger.

source: དེ་ནི་གཉིད་ཀྱང་ལོག་པར་འགྱུར། །ཡང་ན་ཤིན་ཏུ་ན་བར་འགྱུར། །
en: One sleeps, Or is in excruciating pain.

source: རྟག་ཏུ་གྱེན་དུ་ལྟ་བར་འགྱུར། །སྐར་མ་དག་ལ་སྙེགས་པར་བགྱིད། །
en: “One constantly looks upward, As though chasing the stars.

source: ནུབ་མོ་ཤིན་ཏུ་དགའ་བར་འགྱུར། །རྟག་ཏུ་འདར་ཞིང་སྒྲ་འབྱིན་ཏེ། །
en: At night one is in ecstasy, Constantly writhing and groaning.

source: དེ་ལ་སྔགས་ཀྱི་ཚིག་མཆིས་ཀྱིས། །འཇིག་རྟེན་མགོན་པོ་བདག་ལ་གསོན།
en: “There are mantra syllables for this,

source: བདག་གི་སྔགས་ཀྱི་ཚིག་རྣམས་གྲུབ་པར་གྱུར་ཅིག །
en: May my mantra syllables be fulfilled!

source: རྒྱལ་པོ་ཆེན་པོ་རྣམ་ཐོས་ཀྱི་བུའི་མིང་དང་། སྟོབས་དང་། དབང་ཕྱུག་དང་། བྱིན་གྱིས་བདག་དགེ་བར་གྱུར་ཅིག
en: May the name, power, sovereignty, and might of the great king Vaiśravaṇa bring me well-being!

source: དེ་ནས་རྒྱལ་པོ་ཆེན་པོ་ཡུལ་འཁོར་སྲུང་སྟན་ལས་ལངས་ཏེ།
en: Next, the great king Dhṛtarāṣṭra arose from his seat,

source: བཅོམ་ལྡན་འདས་བདག་གི་འཁོར་དྲི་ཟའི་གདོན་གྱིས་བཏབ་པའི་ཚུལ་གྱི་མཚན་མ་ནི་འདི་ལྟ་བུ་ལགས་ཏེ།
en: “The symptoms of being afflicted by a gandharva graha from my entourage, Blessed One, are as follows:

source: བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་ནས་བཅོམ་ལྡན་འདས་ཉིད་ལ་ཕྱག་འཚལ་ཞིང་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: Bowing to the Blessed One with palms joined, he said to him,

source: གླུ་ལེན་ཅིང་ནི་བྲོ་རྡུང་སྟེ། །རྒྱན་རྣམས་ལ་ཡང་དགའ་བར་བགྱིད། །
en: “One sings and dances, And also indulges in jewelry.

source: བརྐམ་པ་མ་མཆིས་མང་བར་སྨྲ། །རྒོད་པར་བགྱིད་ཅིང་ཁྲོ་བར་འགྱུར། །
en: One is without avarice and speaks profusely, Laughs, and is prone to anger.

source: སྐོམ་པར་འགྱུར་ལ་མིག་དམར་ཏེ། །རྟག་ཏུ་རིམས་ཀྱིས་འདེབས་པར་བགྱིད། །
en: “One is thirsty, has red eyes, And is constantly suffering with fever.

source: མིག་ཀྱང་འབྱེད་པར་མི་བགྱིད་དེ། །རྒྱབ་ཀྱིས་ཕྱོགས་ཤིང་ཉལ་བར་བགྱིད། །
en: Unable to open one’s eyes, One lies with face averted.

source: རྒྱལ་པོ་ཆེན་པོ་ཡུལ་འཁོར་སྲུང་གི་མིང་དང་། སྟོབས་དང་། དབང་ཕྱུག་དང་། བྱིན་གྱིས་བདག་གདོན་ཐམས་ཅད་དང་གནོད་པ་ཐམས་ཅད་ལས་ཐར་བར་གྱུར་ཅིག
en: Through the name, power, sovereignty, and might of the great king Dhṛtarāṣṭra, may I be free of all grahas and misfortunes!

source: དེ་ནས་རྒྱལ་པོ་ཆེན་པོ་འཕགས་སྐྱེས་པོ་སྟན་ལས་ལངས་ཏེ།
en: Then it was the great king Virūḍhaka who arose from his seat,

source: བཅོམ་ལྡན་འདས་བདག་གི་འཁོར་ཡི་དགས་གྲུལ་བུམ་གྱིས་ཟིན་པའི་ཚུལ་གྱི་མཚན་མ་ནི་འདི་ལྟ་བུ་ལགས་ཏེ།
en: “The symptoms of being afflicted by a preta kumbhāṇḍa from my entourage, Blessed One, are as follows:

source: ཤིན་ཏུ་སྐོམ་པས་འདེབས་པར་འགྱུར། །གཡེང་བས་བཏབ་ཅིང་ལྟ་བར་འགྱུར། །
en: “One becomes afflicted with extreme thirst And looks about with bewilderment.

source: བཞིན་ཡང་དམར་པོར་གདའ་བར་འགྱུར། །བསྐུམས་ནས་ས་ལ་ཉལ་བར་འགྱུར། །
en: One’s face turns red, And one lies curled up on the ground.

source: ཁ་དོག་ངན་ཅིང་ལུས་ཀྱང་སྐེམ། །སྐྲ་དང་སེན་མོ་རིང་བ་སྟེ། །
en: “One’s complexion becomes sickly and one’s body emaciated. One’s hair and nails grow long.

source: དྲི་མ་ཅན་ལ་དྲི་མི་བདའ། །བརྫུན་དང་ཀྱལ་པ་སྨྲ་བར་བགྱིད།
en: One becomes filthy and malodorous. One utters falsehoods and nonsense.

source: རྒྱལ་པོ་ཆེན་པོ་འཕགས་སྐྱེས་པོའི་མིང་དང་། སྟོབས་དང་། དབང་ཕྱུག་དང་། བྱིན་གྱིས་བདག་གི་གདོན་དང་། གནོད་པ་ཐམས་ཅད་ཞི་བར་གྱུར་ཅིག
en: Through the name, power, sovereignty, and might of the great king Virūḍhaka, may all grahas and misfortunes be pacified for me!

source: དེ་ནས་རྒྱལ་པོ་ཆེན་པོ་མིག་མི་བཟང་སྟན་ལས་ལངས་ཏེ།
en: The great king Virūpākṣa now arose from his seat,

source: བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་ནས། བཅོམ་ལྡན་འདས་ཉིད་ལ་ཕྱག་འཚལ་ཞིང་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: Bowing to the Blessed One with palms joined, he said to him,

source: བཅོམ་ལྡན་འདས་བདག་གི་འཁོར་ཀླུ་འདབ་བཟངས་ཀྱི་གདོན་གྱིས་བཏབ་པའི་ཚུལ་གྱི་མཚན་མ་ནི་འདི་ལྟ་བུ་ལགས་ཏེ།
en: “The symptoms of being afflicted by a fine-winged nāga graha from my entourage, Blessed One, are as follows:

source: སྐྱིགས་བུས་འདེབས་ཤིང་དབུགས་ཀྱང་འབྱིན། །དེ་བཞིན་དབུགས་ཀྱང་གྲང་བར་འགྱུར། །
en: “One hiccups and pants. Likewise, one’s breath becomes cold.

source: རྔུལ་ཞིང་དབུ་བ་ཁ་ཆུ་འབྱུང་། །ཕྱི་ཕྱིར་གཉིད་ཀྱང་ལོག་པར་འགྱུར། །
en: One perspires and drools. One falls asleep repeatedly.

source: ཁ་དོག་ལྡན་ཞིང་དཔའ་བ་སྟེ། །དེ་བཞིན་འདར་ཞིང་རྒྱུག་པར་འགྱུར། །
en: “Full in complexion and strong, Accordingly, one thrashes and runs about,

source: སེན་མོ་དག་ཀྱང་སྟོན་པར་བགྱིད། །དོག་སར་མཆིས་ཤིང་ངུ་བར་བགྱིད། །
en: Bares one’s finger nails, And throws oneself on the ground wailing.

source: རྒྱལ་པོ་ཆེན་པོ་མིག་མི་བཟང་གི་མིང་དང་། སྟོབས་དང་། དབང་ཕྱུག་དང་། བྱིན་གྱིས་བདག་དགེ་བར་གྱུར་ཅིག
en: Through the name, power, sovereignty, and might of the great king Virūpākṣa, may I have well-being!

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དེའི་ཚེ་འཁོར་ཐམས་ཅད་ཀྱི་མདུན་དུ་སེང་གེའི་སྒྲ་བསྒྲགས་པ།
en: At this, the Blessed One sounded a lion’s roar before the whole assembly:

source: ང་ནི་སྟོབས་བཅུ་དང་ལྡན་ཞིང་མི་འཇིགས་པ་བཞིས་འཇིགས་པ་མེད་པ་སྟེ། འཁོར་གྱི་ནང་དུ་སེང་གེའི་སྒྲ་ཁྱུ་མཆོག་ལྟ་བུ་རྒྱ་ཆེན་པོ་ཡང་དག་པར་བསྒྲགས་སོ། །
en: “I, replete with the ten powers and emboldened by the four types of fearlessness, will perfectly roar out a great lion’s roar like the leader of the pack amid the assembly.

source: ཚངས་པའི་འཁོར་ལོ་བསྐོར་རོ།
en: I will turn the wheel of Brahmā.

source: སྡེ་དང་མཐུ་དང་བཞོན་བཅས་པའི། །བདུད་ཀྱང་གཅིག་གིས་རབ་ཏུ་བཏུལ། །
en: “Only one can defeat Māra, With his sentinels, troops, and mounts!

source: སེམས་ཅན་ཐམས་ཅད་བསྲུང་བའི་ཕྱིར། །རིག་སྔགས་ཐམས་ཅད་ང་ལ་ཉོན།
en: For the sake of protecting all beings, Listen to me for all incantations!

source: དེ་བཞིན་གཤེགས་པའི་མཚན་དང་། སྟོབས་དང་། དབང་ཕྱུག་དང་། བྱིན་གྱིས་བདག་དགེ་བར་གྱུར་ཅིག །
en: May the name, power, sovereignty, and might of the Thus-Gone One bring me well-being!

source: ཕྱོགས་བཞིའི་འཇིག་རྟེན་སྐྱོང་བ་དག །སངས་རྒྱས་ཀྱི་ནི་གསུང་ཐོས་ནས། །
en: Once the guardians of the world in the four quarters Heard the Buddha’s speech,

source: འཇིགས་དང་སྐྲག་དང་དངངས་གྱུར་ཏེ། །ཐལ་མོ་སྦྱར་ནས་འཁོད་པར་གྱུར། །
en: Frightened, petrified, and timid, They sat down with palms joined.

source: འབྱུང་པོའི་ཚོགས་ནི་ལྷགས་པ་རྣམས། །དངངས་འཁྲུགས་རོད་རོད་པོར་གྱུར་ནས། །
en: The gatherings of bhūtas that remained, Frightened, bewildered, and panicked,

source: ཕྱོགས་བཅུར་རབ་ཏུ་འབྱེར་བྱེད་ཅིང་། །སྒྲ་བོ་ཆེ་ཡང་སྒྲོགས་པར་བྱེད། །
en: Fled throughout the ten directions, Crying out with loud wails.

source: རྒྱལ་པོ་ཆེན་པོས་དེ་ཤེས་ནས། །གསང་བ་གསུམ་ནི་ཡང་དག་སྨྲ། །
en: Perceiving that, the great kings Proclaimed three secrets:

source: ཀྱེ་མ་རིག་སྔགས་རིག་སྔགས་ཆེ། །སྟོང་ཆེན་རབ་ཏུ་འཇོམས་བྱེད་པ། །
en: “Wondrous! Incantation, great incantation, That destroys the great trichiliocosm!

source: སངས་རྒྱས་ཀྱིས་ནི་གསུངས་པ་དེ། །ཐོས་ནས་འབྱུང་པོ་སྐྲག་གྱུར་ཏེ། །
en: “Hearing this speech of the Buddha, The bhūtas have become frightened.

source: དཔེར་ན་རབ་ཏུ་འབར་མེ་དང་། །ཏིལ་མར་ངར་བཏགས་རལ་གྲི་བཞིན། །
en: It is like a raging fire, Or like a sword striking sesame butter.

source: གཽ་ཏ་མས་ནི་རབ་བཤད་པའི། །རིག་སྔགས་སྤུ་གྲིའི་སོ་དང་འདྲ། །
en: “The incantation disclosed by Gautama Is like a razor blade.

source: དྲང་སྲོང་ཚིག་ནི་ལེགས་བཤད་པ། །དེ་ལ་གང་ཞིག་མ་དད་ན། །དེ་ཡི་བུ་ཡི་ཐུ་བོ་ནི། །ཚངས་པའི་ཞགས་པས་མེད་པར་འགྱུར། །
en: Whoever disregards That speech of the Sage, so eloquently uttered, “Will have his oldest son Eliminated by Brahmā’s noose.

source: མེ་ནི་རབ་ཏུ་འབར་བྱས་ནས། །བླ་དང་འོག་དང་ཕྱོགས་བཞིར་ཡང་། །སྦྱིན་སྲེག་གི་ནི་ཆུས་གཏོར་ཏེ། །
en: Ignite a blazing fire, Scatter the water of the burnt offering “Above, below, and throughout the four directions,

source: ནས་དང་ཡུངས་ཀར་བླངས་ནས་སུ། །མར་གྱི་སྙིང་པོ་དང་སྦྱར་ནས། །མེ་ཡི་ནང་དུ་བླུག་པར་བྱ། །
en: Then take barley grains and white mustard seeds, Combined with clarified butter, And pour them into the fire.

source: ལེགས་པར་གསུངས་པ་འདི་ཐོས་ནས། །གལ་ཏེ་མྱུར་དུ་མི་གཏོང་ན། །ཐམས་ཅད་འབར་བར་འགྱུར་བ་ནི། །མར་དང་ཡུངས་ཀར་མེར་བླུགས་བཞིན། །
en: “If, upon hearing this eloquent utterance, They do not quickly exclaim it, They will be incinerated, Like butter and white mustard seeds poured into a fire.

source: གནོད་སྦྱིན་ཆད་པས་བསྡིགས་ནས་སུ། །དེ་དག་བདེ་བ་མི་རྙེད་དེ། །
en: “Threatened with the punishment of yakṣas, They will not be well—

source: དེ་ཡི་རྩིབ་ལོགས་གཡས་པར་ནི། །འབྲས་ཆེན་ནད་ཀྱང་འབྱུང་བར་འགྱུར། །
en: Large boils will form On the right side of the rib cage.

source: གནོད་སྦྱིན་ནད་ཀྱིས་བཏབ་པ་ན། །ཤ་བཀྲའི་ནད་ཀྱིས་བཏབ་པར་འགྱུར། །
en: “Afflicted with a yakṣa illness, They will contract white leprosy,

source: ལྕང་ལོ་ཅན་གྱི་ཕོ་བྲང་དུ། །གཞར་ཡང་འགྲོ་བར་མི་འགྱུར་རོ།
en: And never travel To the palace of Aḍakavatī.

source: ལུས་ངན་གྲོགས་དང་ལྡན་པ་ཡི། །ཁྱིམ་ཡང་མཐོང་བར་མི་འགྱུར་ཏེ། །
en: “They will not see the home Of illustrious Kubera,

source: འབྱུང་པོ་མང་པོ་ཚོགས་པ་ན། །སྟན་ཡང་ཐོབ་པར་མི་འགྱུར་རོ།
en: Nor find a seat In the company of the bhūta assemblies.

source: གནོད་སྦྱིན་དག་ནི་དཀྱིལ་འཁོར་དུ། །ཟས་སྐོམ་དང་ཡང་འབྲལ་བར་འགྱུར། །
en: “In the circle of yakṣas, They will be without food and drink.

source: སྟོང་ཆེན་རབ་འཇོམས་མདོ་སྡེ་ལ། །གནོད་སྦྱིན་གང་དག་མི་ཕྱོགས་པ། །དེ་ལ་རྡོ་རྗེ་འཆང་ཁྲོས་ཏེ། །
en: “Any yakṣa that does not heed This sūtra, Destroyer of the Great Trichiliocosm , Will incur the wrath of Vajradhara,

source: སྤྱི་བོ་དག་ནི་འགེམས་པར་འགྱུར། །
en: will split open his forehead,
